In [81]:
#mysql과 python 연동
# 1. 라이브러리 설치
# 2. sql서버의 정보 입력
# 3. sql서버에 접속
# 4. sql 쿼리문을 이용하여 대아터를 crud 작업

In [82]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\새 폴더\python\lib\site-packages (1.0.2)

In [83]:
import pymysql 
import pandas as pd

In [84]:
# sql 서버 정보 입력  >> DB 접속

_db = pymysql.Connect(
        user="root",
        password= "0403",
        host = "localhost",
        db= "ubion1",
        port=3306



)

In [100]:
# cursor 변수
# sql 쿼리문을 실행시키기 위해서 만들어야한는 필수 변수
# DictCursod는 sql쿼리문이 실행되고 나온 데이터를 딕셔너리 형태로 받는다

cursor = _db.cursor(pymysql.cursors.DictCursor)

In [127]:
sql = """
        select 
        * 
        from
        user_info
    """
    
cursor.execute(sql)

result = cursor.fetchall()
print(result)

[{'id': '1', 'name': '2', 'age': 3, 'address': '4'}, {'id': '3145', 'name': '1243', 'age': 123, 'address': '124'}, {'id': '5', 'name': '5', 'age': 5, 'address': '5'}, {'id': 'abc', 'name': '30', 'age': 20, 'address': 'ubion11'}, {'id': 'good', 'name': 'hello', 'age': 25, 'address': 'ubion'}, {'id': 'Hello', 'name': 'Would', 'age': 777777, 'address': 'ubion'}, {'id': 'Hi', 'name': 'hello', 'age': 99999, 'address': 'jip'}, {'id': 'test', 'name': 'moon', 'age': None, 'address': 'ubion'}, {'id': 'test10', 'name': 'new', 'age': 99, 'address': 'house'}, {'id': 'test11', 'name': 'park', 'age': 40, 'address': 'ubion10'}, {'id': 'test2', 'name': 'kim', 'age': 30, 'address': 'ubion'}, {'id': 'test4', 'name': 'park', 'age': 30, 'address': 'ubion2'}, {'id': 'test9', 'name': 'lee', 'age': 25, 'address': 'ubion5'}]

In [87]:
pd.DataFrame(result)

      id name   age address
0   test  lee   NaN   ubion
1  test2  kim  20.0   ubion

In [104]:
sql = """ 
        insert into
        user_info(id, name, age)
        values
        ("good", "hello", 25)
    """

cursor.execute(sql)

1

In [105]:
_db.commit()

In [ ]:
sql = """
        select 
        createDt as 날짜,
        deathCnt as 사망자,
        decideCnt as 확진자
        from
        corona
        order by
        createDt    
    """

cursor.execute(sql)
result = cursor.fetchall()
df = pd.DataFrame(result)
df

                          날짜    사망자       확진자
0    2020-03-10 00:00:00.000     54      7513
1    2020-03-11 00:00:00.000     60      7755
2    2020-03-12 00:00:00.000     66      7869
3    2020-03-13 00:00:00.000     67      7979
4    2020-03-14 00:00:00.000     72      8086
..                       ...    ...       ...
815  2022-06-04 08:56:49.219  24238  18153814
816  2022-06-05 08:53:19.426  24258  18163648
817  2022-06-06 09:00:06.734  24279  18168670
818  2022-06-07 09:09:00.897  24299  18174842
819  2022-06-08 09:09:05.982  24305  18188200

[820 rows x 3 columns]

In [ ]:
# sql 쿼리문 실행 함수
# 1. select() 함수 생성
# 2. 매개변수 두개 
# 3. 매개변수 sql은 sql쿼리문을 입력 받는 변수
# 4. 매개변수 limit의 기본값은 0
# 5. limit가 0인 경우 쿼리문의 결과를 전부 보여줌 0이 아닌 경우에는 limit의 개수 만큼 행을 보여준다
# 6. sql 쿼리문을 박아서 실행하고 결과값을 데이터프레임으로 만들어서 리턴

In [ ]:
def select(sql,limit=0):
    cursor.execute(sql)
    result = cursor.fetchall()
    if limit != 0:
        result = result[:limit]
    result = pd.DataFrame(result)
    return result


select(sql, 6)

                        날짜  사망자   확진자
0  2020-03-10 00:00:00.000   54  7513
1  2020-03-11 00:00:00.000   60  7755
2  2020-03-12 00:00:00.000   66  7869
3  2020-03-13 00:00:00.000   67  7979
4  2020-03-14 00:00:00.000   72  8086
5  2020-03-15 00:00:00.000   75  8162

In [ ]:
# input을 이용하여 입력받은 데이터 값을 insert
# 1. input 함수를 이용하여 데이터 3개 받아온다
# 2. insert문을 이용하여  user_info 테이블에  id, name, age, address 항목에 삽입

In [ ]:
_id = input("id:")
_name = input("name :")
_age = input("age:")
_address = input("address:")



sql = f""" 
        insert into
        user_info
        values
        ("{_id}", "{_name}", "{_age}", "{_address}")
    """
# cursor.execute(sql,[_id,_name, _age, _address])

cursor.execute(sql)
_db.commit()

In [94]:
# def insert(sql, *data) :
#     cursor.execute(sql,data)
#     _db.commit()
#     cursor.fetchall()
    
# sql = """ insert into
#         """

In [129]:
# 데이터베이스와의 접속 종료
_db.close()

Error: Already closed

In [99]:
# 외부에 있는 서버와의 접속
# root아이디는 내부에서만 접속이 가능한 아이디 
_db = pymysql.connect(
    user = "ubion",
    password = "1234",
    host = "172.16.12.149",
    db = "ubion",
    port = 3306
)